i5/20240111-1147/0-master/1000/pgbench.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 250
partition method: range
partitions: 1000
query mode: prepared
number of clients: 64
number of threads: 64
maximum number of tries: 1
duration: 15 s
number of transactions actually processed: 383608
number of failed transactions: 0 (0.000%)
latency average = 2.506 ms
initial connection time = 29.488 ms
tps = 25535.004093 (without initial connection time)